Autodesk.Revit.DB.Structure.IConnectionTypeChangedServer.ConnectionTypeChanged(Autodesk.Revit.DB.Structure.ConnectionTypeChangedServiceData)
The server's method that is called when a structural connection changes it's type.
Remarks:
The method should always return 'true' if the server is successfully executed, no matter whether the server changes anything.
Return 'false' or if the server throws, indicates a failed case, all changes made by the server will be discarded.
data:
The data that contains the structural connection element
Returns:
Indicates whether the connection type changed server is executed successfully.
Since:
2017

Autodesk.Revit.DB.Structure.IConnectionTypeChangedServer
Interface for external servers implementing connection type changed service.
Remarks:
It's exposed in internal API.
Since:
2017